# DATA-PREPROCESSING

# Set Directory

# install Stat Library

# 1. Merge DataFrames

In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('df1.csv')

In [3]:
df2 = pd.read_csv('df2.csv')

# Merge 2 DataFrames

In [4]:
df1.head()

,ID,Year_Birth,Education,Marital_Status,income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/2014,0,189,104,379,111,189,218,1,4,4,6,1
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/2014,0,464,5,64,7,0,37,1,7,3,7,5
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/2014,0,134,11,59,15,2,30,1,3,2,5,2
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/2014,0,10,0,1,0,0,0,1,1,0,2,7
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/2014,0,6,16,24,11,0,34,2,3,1,2,7

In [5]:
df2.head()

,ID,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Response,Complain,Country,Sex
0,1826,0,0,0,0,0,1,0,SP,0.0
1,1,0,0,0,0,1,1,0,CA,0.0
2,10476,0,0,0,0,0,0,0,US,0.0
3,1386,0,0,0,0,0,0,0,AUS,0.0
4,5371,1,0,0,0,0,1,0,SP,0.0

In [6]:
df1.shape

(2240, 20)

In [7]:
df2.shape

(2240, 10)

In [8]:
# How many unique IDs? 
# TO MAKE SURE each row's information needs to be "INDEPENDENT"!!
df1.ID.nunique()

2240

In [9]:
# What if IDs don't match?
df2.ID.nunique()

2240

In [10]:
# Make sure the columns name before merge!
df1.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth'],
      dtype='object')

In [11]:
df2.columns

Index(['ID', 'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country', 'Sex'],
      dtype='object')

In [12]:
# Name the new file
Mar_1 = pd.merge(df1, df2)

In [13]:
# 'Automatically' match the same columns
# This collects all common columns in both DataFrames and replaces each common column in both DF
Mar_1.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country', 'Sex'],
      dtype='object')

In [14]:
Mar_1.shape

(2240, 29)

In [15]:
Mar_1.shape[1]

29

In [16]:
Mar_1.head()
# Check Dataset repeatedly
# 29 cols is right (20+10-1), because both of df1 & df2 have 'ID'

,ID,Year_Birth,Education,Marital_Status,income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Response,Complain,Country,Sex
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/2014,0,189,...,1,0,0,0,0,0,1,0,SP,0.0
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/2014,0,464,...,5,0,0,0,0,1,1,0,CA,0.0
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/2014,0,134,...,2,0,0,0,0,0,0,0,US,0.0
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/2014,0,10,...,7,0,0,0,0,0,0,0,AUS,0.0
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/2014,0,6,...,7,1,0,0,0,0,1,0,SP,0.0

In [17]:
Mar_1.shape

(2240, 29)

In [18]:
# Supplementary Info for Merge DFs
A = pd.DataFrame({'animal':['dog','cat','bird'],'num':[1,2,3]})
A

  animal  num
0    dog    1
1    cat    2
2   bird    3

In [19]:
B = pd.DataFrame({'animal':['dog','cat','fish'],'color':['B','W','R']})
B

  animal color
0    dog     B
1    cat     W
2   fish     R

In [20]:
# Inner join 交集
# Observations in both A and B
pd.merge(A, B, how='inner')

  animal  num color
0    dog    1     B
1    cat    2     W

In [21]:
# Outer join 聯集
# Observations in both A or B
pd.merge(A, B, how='outer')

  animal  num color
0    dog  1.0     B
1    cat  2.0     W
2   bird  3.0   NaN
3   fish  NaN     R

In [22]:
# Left join 
# 只返回左側ＤＦ所有行，以及右側ＤＦ中與左側匹配的行，沒有匹配以 NaN 顯示
# Observations in A
pd.merge(A, B, how='left')

  animal  num color
0    dog    1     B
1    cat    2     W
2   bird    3   NaN

In [23]:
# Right join 
# 只返回右側ＤＦ所有行，以及左側ＤＦ中與右側匹配的行，沒有匹配以 NaN 顯示
# Observations in B
pd.merge(A, B, how='right')

  animal  num color
0    dog  1.0     B
1    cat  2.0     W
2   fish  NaN     R

In [24]:
# What if the columns don't have the same name: pd.merge(df1,df2, left_on = 'A', right_on = 'B')
# Use pandas.merge() on multiple columns: df2 = pd.merge(df, df1, on=['A', 'B'])
# Use pandas.merge() on multiple columns: pd.merge(df, df1, how='left', left_on=['A', 'B'], right_on=['A', 'B'])
# Merge Pandas DataFrames using Left_on and right_on: merged_of = pd.merge(df, df1, left_on="A", right_on="B", how="left")
# Set value of on parameter to specify the KEY value for merge in pandas: merged_of = pd.merge(df, df1, on="ID", how="inner")

# P.S.

### What if the columns don't have the same name: pd.merge(df1,df2, left_on = 'A', right_on = 'B')

### Use pandas.merge() on multiple columns: df2 = pd.merge(df, df1, on=['A', 'B'])

In [25]:
df = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                   'B': ['B0', 'B1', 'B2'],
                   'value_df': [1, 2, 3]})
df

    A   B  value_df
0  A0  B0         1
1  A1  B1         2
2  A2  B2         3

In [26]:
df1 = pd.DataFrame({'A': ['A1', 'A2', 'A3'],
                    'B': ['B1', 'B2', 'B3'],
                    'value_df1': ['X', 'Y', 'Z']})
df1

    A   B value_df1
0  A1  B1         X
1  A2  B2         Y
2  A3  B3         Z

In [27]:
result = pd.merge(df, df1, on=['A', 'B'])

print(result)

    A   B  value_df value_df1
0  A1  B1         2         X
1  A2  B2         3         Y

In [28]:
A = pd.DataFrame({'animal': ['cat', 'dog', 'elephant'],
                  'value_A': [1, 2, 3]})
A

     animal  value_A
0       cat        1
1       dog        2
2  elephant        3

In [29]:
B = pd.DataFrame({'animal': ['dog', 'elephant', 'lion'],
                  'value_B': ['X', 'Y', 'Z']})
B

     animal value_B
0       dog       X
1  elephant       Y
2      lion       Z

In [30]:
pd.merge(A,B,left_on='animal',right_on='animal')

     animal  value_A value_B
0       dog        2       X
1  elephant        3       Y